src/logs/desempenho/cenario1/ack1/log-1-10000-17.out
Topic to send: test-topic
Topic to acks: 1
Records: 80000
Size:10000
1197 records sent, 239,4 records/sec (2,28 MB/sec), 4,1 ms avg latency, 276,0 ms max latency.
1372 records sent, 274,4 records/sec (2,62 MB/sec), 3,6 ms avg latency, 14,0 ms max latency.
1435 records sent, 286,9 records/sec (2,74 MB/sec), 3,5 ms avg latency, 29,0 ms max latency.
1447 records sent, 289,3 records/sec (2,76 MB/sec), 3,4 ms avg latency, 14,0 ms max latency.
1454 records sent, 290,7 records/sec (2,77 MB/sec), 3,4 ms avg latency, 23,0 ms max latency.
1455 records sent, 290,9 records/sec (2,77 MB/sec), 3,4 ms avg latency, 35,0 ms max latency.
1463 records sent, 292,6 records/sec (2,79 MB/sec), 3,4 ms avg latency, 29,0 ms max latency.
1471 records sent, 294,1 records/sec (2,80 MB/sec), 3,4 ms avg latency, 34,0 ms max latency.
1484 records sent, 296,7 records/sec (2,83 MB/sec), 3,4 ms avg latency, 14,0 ms max latency.
1463 records sent, 292,6 records/sec (2,79 MB/sec), 3,4 ms avg latency, 91,0 ms max latency.
1476 records sent, 295,1 records/sec (2,81 MB/sec), 3,4 ms avg latency, 14,0 ms max latency.
1472 records sent, 294,2 records/sec (2,81 MB/sec), 3,4 ms avg latency, 30,0 ms max latency.
1466 records sent, 293,1 records/sec (2,80 MB/sec), 3,4 ms avg latency, 38,0 ms max latency.
1452 records sent, 290,3 records/sec (2,77 MB/sec), 3,4 ms avg latency, 46,0 ms max latency.
1467 records sent, 293,3 records/sec (2,80 MB/sec), 3,4 ms avg latency, 36,0 ms max latency.
1455 records sent, 290,9 records/sec (2,77 MB/sec), 3,4 ms avg latency, 71,0 ms max latency.
1472 records sent, 294,4 records/sec (2,81 MB/sec), 3,4 ms avg latency, 14,0 ms max latency.
1460 records sent, 291,9 records/sec (2,78 MB/sec), 3,4 ms avg latency, 46,0 ms max latency.
1481 records sent, 296,2 records/sec (2,82 MB/sec), 3,4 ms avg latency, 27,0 ms max latency.
1469 records sent, 293,8 records/sec (2,80 MB/sec), 3,4 ms avg latency, 50,0 ms max latency.
1489 records sent, 297,8 records/sec (2,84 MB/sec), 3,3 ms avg latency, 8,0 ms max latency.
1482 records sent, 296,3 records/sec (2,83 MB/sec), 3,4 ms avg latency, 38,0 ms max latency.
1510 records sent, 301,9 records/sec (2,88 MB/sec), 3,3 ms avg latency, 8,0 ms max latency.
1503 records sent, 300,5 records/sec (2,87 MB/sec), 3,3 ms avg latency, 15,0 ms max latency.
1501 records sent, 300,1 records/sec (2,86 MB/sec), 3,3 ms avg latency, 11,0 ms max latency.
1477 records sent, 295,2 records/sec (2,82 MB/sec), 3,4 ms avg latency, 58,0 ms max latency.
1470 records sent, 294,0 records/sec (2,80 MB/sec), 3,4 ms avg latency, 45,0 ms max latency.
1463 records sent, 292,0 records/sec (2,78 MB/sec), 3,4 ms avg latency, 78,0 ms max latency.
1488 records sent, 297,2 records/sec (2,83 MB/sec), 3,4 ms avg latency, 33,0 ms max latency.
1480 records sent, 295,8 records/sec (2,82 MB/sec), 3,4 ms avg latency, 4,0 ms max latency.
1483 records sent, 296,4 records/sec (2,83 MB/sec), 3,4 ms avg latency, 27,0 ms max latency.
1480 records sent, 295,9 records/sec (2,82 MB/sec), 3,4 ms avg latency, 5,0 ms max latency.
1452 records sent, 290,3 records/sec (2,77 MB/sec), 3,4 ms avg latency, 77,0 ms max latency.
1487 records sent, 297,4 records/sec (2,84 MB/sec), 3,3 ms avg latency, 33,0 ms max latency.
1491 records sent, 298,0 records/sec (2,84 MB/sec), 3,3 ms avg latency, 5,0 ms max latency.
1486 records sent, 297,1 records/sec (2,83 MB/sec), 3,3 ms avg latency, 10,0 ms max latency.
1493 records sent, 298,5 records/sec (2,85 MB/sec), 3,3 ms avg latency, 6,0 ms max latency.
1482 records sent, 296,3 records/sec (2,83 MB/sec), 3,4 ms avg latency, 23,0 ms max latency.
1484 records sent, 296,7 records/sec (2,83 MB/sec), 3,4 ms avg latency, 14,0 ms max latency.
1480 records sent, 295,9 records/sec (2,82 MB/sec), 3,4 ms avg latency, 29,0 ms max latency.
1476 records sent, 295,1 records/sec (2,81 MB/sec), 3,4 ms avg latency, 4,0 ms max latency.
1474 records sent, 294,7 records/sec (2,81 MB/sec), 3,4 ms avg latency, 32,0 ms max latency.
1478 records sent, 295,6 records/sec (2,82 MB/sec), 3,4 ms avg latency, 8,0 ms max latency.
1470 records sent, 293,9 records/sec (2,80 MB/sec), 3,4 ms avg latency, 27,0 ms max latency.
1378 records sent, 275,5 records/sec (2,63 MB/sec), 3,6 ms avg latency, 274,0 ms max latency.
1496 records sent, 299,0 records/sec (2,85 MB/sec), 3,3 ms avg latency, 4,0 ms max latency.
1478 records sent, 295,6 records/sec (2,82 MB/sec), 3,4 ms avg latency, 36,0 ms max latency.
1482 records sent, 296,3 records/sec (2,83 MB/sec), 3,4 ms avg latency, 10,0 ms max latency.
1479 records sent, 295,7 records/sec (2,82 MB/sec), 3,4 ms avg latency, 36,0 ms max latency.
1481 records sent, 296,1 records/sec (2,82 MB/sec), 3,4 ms avg latency, 8,0 ms max latency.
1471 records sent, 294,1 records/sec (2,81 MB/sec), 3,4 ms avg latency, 34,0 ms max latency.
1481 records sent, 296,1 records/sec (2,82 MB/sec), 3,4 ms avg latency, 31,0 ms max latency.
1477 records sent, 295,2 records/sec (2,82 MB/sec), 3,4 ms avg latency, 28,0 ms max latency.
1485 records sent, 296,8 records/sec (2,83 MB/sec), 3,4 ms avg latency, 4,0 ms max latency.
80000 records sent, 293,222886 records/sec (2,80 MB/sec), 3,39 ms avg latency, 276,00 ms max latency, 3 ms 50th, 4 ms 95th, 4 ms 99th, 8 ms 99.9th.

Metric Name                                                                          Value
app-info:commit-id:{client-id=producer-1}                                          : d4284cbebb6f0a4c
app-info:start-time-ms:{client-id=producer-1}                                      : 1591589339807
app-info:version:{client-id=producer-1}                                            : 2.3.1
kafka-metrics-count:count:{client-id=producer-1}                                   : 126,000
producer-metrics:batch-size-avg:{client-id=producer-1}                             : 10077,000
producer-metrics:batch-size-max:{client-id=producer-1}                             : 10077,000
producer-metrics:batch-split-rate:{client-id=producer-1}                           : 0,000
producer-metrics:batch-split-total:{client-id=producer-1}                          : 0,000
producer-metrics:buffer-available-bytes:{client-id=producer-1}                     : 33554432,000
producer-metrics:buffer-exhausted-rate:{client-id=producer-1}                      : 0,000
producer-metrics:buffer-exhausted-total:{client-id=producer-1}                     : 0,000
producer-metrics:buffer-total-bytes:{client-id=producer-1}                         : 33554432,000
producer-metrics:bufferpool-wait-ratio:{client-id=producer-1}                      : 0,000
producer-metrics:bufferpool-wait-time-total:{client-id=producer-1}                 : 0,000
producer-metrics:compression-rate-avg:{client-id=producer-1}                       : 1,000
producer-metrics:connection-close-rate:{client-id=producer-1}                      : 0,000
producer-metrics:connection-close-total:{client-id=producer-1}                     : 0,000
producer-metrics:connection-count:{client-id=producer-1}                           : 4,000
producer-metrics:connection-creation-rate:{client-id=producer-1}                   : 0,000
producer-metrics:connection-creation-total:{client-id=producer-1}                  : 4,000
producer-metrics:failed-authentication-rate:{client-id=producer-1}                 : 0,000
producer-metrics:failed-authentication-total:{client-id=producer-1}                : 0,000
producer-metrics:failed-reauthentication-rate:{client-id=producer-1}               : 0,000
producer-metrics:failed-reauthentication-total:{client-id=producer-1}              : 0,000
producer-metrics:incoming-byte-rate:{client-id=producer-1}                         : 18333,721
producer-metrics:incoming-byte-total:{client-id=producer-1}                        : 4961461,000
producer-metrics:io-ratio:{client-id=producer-1}                                   : 0,016
producer-metrics:io-time-ns-avg:{client-id=producer-1}                             : 17820,570
producer-metrics:io-wait-ratio:{client-id=producer-1}                              : 0,962
producer-metrics:io-wait-time-ns-avg:{client-id=producer-1}                        : 1085094,502
producer-metrics:io-waittime-total:{client-id=producer-1}                          : 261392802748,000
producer-metrics:iotime-total:{client-id=producer-1}                               : 4631612866,000
producer-metrics:metadata-age:{client-id=producer-1}                               : 272,649
producer-metrics:network-io-rate:{client-id=producer-1}                            : 591,350
producer-metrics:network-io-total:{client-id=producer-1}                           : 160010,000
producer-metrics:outgoing-byte-rate:{client-id=producer-1}                         : 3000336,672
producer-metrics:outgoing-byte-total:{client-id=producer-1}                        : 811749029,000
producer-metrics:produce-throttle-time-avg:{client-id=producer-1}                  : 0,000
producer-metrics:produce-throttle-time-max:{client-id=producer-1}                  : 0,000
producer-metrics:reauthentication-latency-avg:{client-id=producer-1}               : NaN
producer-metrics:reauthentication-latency-max:{client-id=producer-1}               : NaN
producer-metrics:record-error-rate:{client-id=producer-1}                          : 0,000
producer-metrics:record-error-total:{client-id=producer-1}                         : 0,000
producer-metrics:record-queue-time-avg:{client-id=producer-1}                      : 0,026
producer-metrics:record-queue-time-max:{client-id=producer-1}                      : 1,000
producer-metrics:record-retry-rate:{client-id=producer-1}                          : 0,000
producer-metrics:record-retry-total:{client-id=producer-1}                         : 0,000
producer-metrics:record-send-rate:{client-id=producer-1}                           : 295,658
producer-metrics:record-send-total:{client-id=producer-1}                          : 80000,000
producer-metrics:record-size-avg:{client-id=producer-1}                            : 10092,000
producer-metrics:record-size-max:{client-id=producer-1}                            : 10092,000
producer-metrics:records-per-request-avg:{client-id=producer-1}                    : 1,000
producer-metrics:request-latency-avg:{client-id=producer-1}                        : 3,325
producer-metrics:request-latency-max:{client-id=producer-1}                        : 36,000
producer-metrics:request-rate:{client-id=producer-1}                               : 295,669
producer-metrics:request-size-avg:{client-id=producer-1}                           : 10147,000
producer-metrics:request-size-max:{client-id=producer-1}                           : 10147,000
producer-metrics:request-total:{client-id=producer-1}                              : 80005,000
producer-metrics:requests-in-flight:{client-id=producer-1}                         : 0,000
producer-metrics:response-rate:{client-id=producer-1}                              : 295,696
producer-metrics:response-total:{client-id=producer-1}                             : 80005,000
producer-metrics:select-rate:{client-id=producer-1}                                : 886,700
producer-metrics:select-total:{client-id=producer-1}                               : 239906,000
producer-metrics:successful-authentication-no-reauth-total:{client-id=producer-1}  : 0,000
producer-metrics:successful-authentication-rate:{client-id=producer-1}             : 0,000
producer-metrics:successful-authentication-total:{client-id=producer-1}            : 0,000
producer-metrics:successful-reauthentication-rate:{client-id=producer-1}           : 0,000
producer-metrics:successful-reauthentication-total:{client-id=producer-1}          : 0,000
producer-metrics:waiting-threads:{client-id=producer-1}                            : 0,000
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node--1}   : 0,000
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node-1}    : 6176,340
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node-3}    : 6043,108
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node-6}    : 6115,497
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node--1}  : 579,000
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node-1}   : 1659662,000
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node-3}   : 1646146,000
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node-6}   : 1655074,000
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node--1}   : 0,000
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node-1}    : 1010796,707
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node-3}    : 988992,436
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node-6}    : 1000808,553
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node--1}  : 67,000
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node-1}   : 271570513,000
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node-3}   : 269358689,000
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node-6}   : 270819760,000
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node--1}  : NaN
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node-1}   : 3,584
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node-3}   : 3,238
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node-6}   : 3,151
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node--1}  : NaN
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node-1}   : 36,000
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node-3}   : 31,000
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node-6}   : 8,000
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node--1}         : 0,000
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node-1}          : 99,609
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node-3}          : 97,460
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node-6}          : 98,628
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node--1}     : NaN
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node-1}      : 10147,000
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node-3}      : 10147,000
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node-6}      : 10147,000
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node--1}     : NaN
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node-1}      : 10147,000
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node-3}      : 10147,000
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node-6}      : 10147,000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node--1}        : 2,000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node-1}         : 26765,000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node-3}         : 26547,000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node-6}         : 26691,000
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node--1}        : 0,000
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node-1}         : 99,621
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node-3}         : 97,469
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node-6}         : 98,637
producer-node-metrics:response-total:{client-id=producer-1, node-id=node--1}       : 2,000
producer-node-metrics:response-total:{client-id=producer-1, node-id=node-1}        : 26765,000
producer-node-metrics:response-total:{client-id=producer-1, node-id=node-3}        : 26547,000
producer-node-metrics:response-total:{client-id=producer-1, node-id=node-6}        : 26691,000
producer-topic-metrics:byte-rate:{client-id=producer-1, topic=test-topic}          : 2979340,740
producer-topic-metrics:byte-total:{client-id=producer-1, topic=test-topic}         : 806148890,000
producer-topic-metrics:compression-rate:{client-id=producer-1, topic=test-topic}   : 1,000
producer-topic-metrics:record-error-rate:{client-id=producer-1, topic=test-topic}  : 0,000
producer-topic-metrics:record-error-total:{client-id=producer-1, topic=test-topic} : 0,000
producer-topic-metrics:record-retry-rate:{client-id=producer-1, topic=test-topic}  : 0,000
producer-topic-metrics:record-retry-total:{client-id=producer-1, topic=test-topic} : 0,000
producer-topic-metrics:record-send-rate:{client-id=producer-1, topic=test-topic}   : 295,658
producer-topic-metrics:record-send-total:{client-id=producer-1, topic=test-topic}  : 80000,000
Produce Time: 272.829
Aplication time: 273.53